alice_in_wonderland = """
"Would you tell me, please, which way I ought to go from here?"
"That depends a good deal on where you want to get to," said the Cat.
"I don't much care where ——" said Alice.
"Then it doesn't matter which way you go," said the Cat.
"—— so long as I get somewhere," Alice added as an explanation.
"Oh, you're sure to do that," said the Cat, 
"if you only walk long enough."
"""
# task 01 == Розділіть змінну alice_in_wonderland так, щоб вона займала декілька фізичних лінії
# task 02 == Знайдіть та відобразіть всі символи одинарної лапки (') у тексті
# task 03 == Виведіть змінну alice_in_wonderland на друк
print(f"==== 1, 2, 3 завдання ===== {alice_in_wonderland}")


"""
    # Задачі 04 -10:
    # Переведіть задачі з книги "Математика, 5 клас"
    # на мову пітон і виведіть відповідь, так, щоб було
    # зрозуміло дитині, що навчається в п'ятому класі
"""


# task 04
"""
Площа Чорного моря становить 436 402 км2, а площа Азовського
моря становить 37 800 км2. Яку площу займають Чорне та Азов-
ське моря разом?
"""
black_sea = 436402
azov_sea = 37800
sum_square = black_sea + azov_sea
print(f"==== 4 завдання ===== \nЗагальна полща обох морів становить —— {sum_square}\n")


# task 05
"""
Мережа супермаркетів має 3 склади, де всього розміщено
375 291 товар. На першому та другому складах перебуває
250 449 товарів. На другому та третьому – 222 950 товарів.
Знайдіть кількість товарів, що розміщені на кожному складі.
"""
all_items = 375291
sklad_1_and_2 = 250449
sklad_2_and_3 = 222950

sklad_3 = all_items - sklad_1_and_2
sklad_1 = all_items - sklad_2_and_3
sklad_2 = sklad_1_and_2 - sklad_1
print("==== 5 завдання =====")
print(f"Склад 1 має —— {sklad_1} товари. Склад 2 має —— {sklad_2} товари. Склад 3 має —— {sklad_3} товари\n")


# task 06
"""
Михайло разом з батьками вирішили купити комп’ютер, ско-
риставшись послугою «Оплата частинами». Відомо, що сплачу-
вати необхідно буде півтора року по 1179 грн/місяць. Обчисліть
вартість комп’ютера.
"""
month_count = 18
money_per_month = 1179
total_cost = month_count * money_per_month
print("==== 6 завдання =====")
print(f"Вартість комп'ютера —— {total_cost} грн.\n")


# task 07
"""
Знайди остачу від діленя чисел:
a) 8019 : 8     d) 7248 : 6
b) 9907 : 9     e) 7128 : 5
c) 2789 : 5     f) 19224 : 9
"""
print("==== 7 завдання =====")
print(f"""8019 : 8 = {8019%8}
9907 : 9 = {9907%9}
2789 : 5 = {2789%5}
7248 : 6 = {7248%6}
7128 : 5 = {7128%5}
19224 : 9 = {19224%9}
""")


# task 08
"""
Іринка, готуючись до свого дня народження, склала список того,
що їй потрібно замовити. Обчисліть, скільки грошей знадобиться
для даного її замовлення.
Назва товару    Кількість   Ціна
Піца велика     4           274 грн
Піца середня    2           218 грн
Сік             4           35 грн
Торт            1           350 грн
Вода            3           21 грн
"""
pizza_l = 274*4
pizza_m = 218*2
juice = 35*4
cake = 350
water = 21*3
print("==== 8 завдання =====")
print(f"Знадобиться {pizza_l + pizza_m + juice + cake + water} грн.\n")


# task 09
"""
Ігор займається фотографією. Він вирішив зібрати всі свої 232
фотографії та вклеїти в альбом. На одній сторінці може бути
розміщено щонайбільше 8 фото. Скільки сторінок знадобиться
Ігорю, щоб вклеїти всі фото?
"""
all_photo = 232
print("==== 9 завдання =====")
print(f"Що вклеїти всі фото, знадобиться {all_photo // 8} сторінок\n")


# task 10
"""
Родина зібралася в автомобільну подорож із Харкова в Буда-
пешт. Відстань між цими містами становить 1600 км. Відомо,
що на кожні 100 км необхідно 9 літрів бензину. Місткість баку
становить 48 літрів.
1) Скільки літрів бензину знадобиться для такої подорожі?
2) Скільки щонайменше разів родині необхідно заїхати на зап-
равку під час цієї подорожі, кожного разу заправляючи пов-
ний бак?
"""
total_fuel = (1600 // 100) * 9
print("==== 10 завдання =====")
print(f"1) Знадобиться {total_fuel} л.")
print(f"2) Заправитись потрібно щонайменше {total_fuel // 48} рази")